; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v6 ?v10)
             (pred_9 ?v4 ?v5)
             (pred_4 ?v6 ?v5)
             (pred_10 ?v13 ?v6 )
	     (pred_6 ?v6)
             (pred_2 ?v9)
             (pred_5 ?v4)
             (pred_8 ?v5)
             (pred_12 ?v6)
             (pred_3 ?v4)
             (pred_11 ?v6)
             (pred_1 ))



(:action op_3
:parameters (?v8 ?v7 ?v3 ?v11)
:precondition (and (pred_2 ?v8) (pred_2 ?v7) (pred_5 ?v3) (pred_8 ?v11)
          (pred_7 ?v8 ?v7) (pred_9 ?v3 ?v11)
                   (pred_4 ?v7 ?v11) (pred_6 ?v8) 
                   (pred_12 ?v7) (pred_3 ?v3))
:effect (and  (pred_11 ?v7) (not (pred_12 ?v7))))


(:action op_2
:parameters (?v8 ?v1)
:precondition (and (pred_2 ?v8) (pred_2 ?v1)
               (pred_6 ?v8) (pred_7 ?v8 ?v1) (pred_11 ?v1))
:effect (and (pred_6 ?v1) (not (pred_6 ?v8))))

(:action op_4
:parameters (?v8 ?v3)
:precondition (and (pred_2 ?v8) (pred_5 ?v3) 
                  (pred_6 ?v8) (pred_10 ?v3 ?v8) (pred_1 ))
:effect (and (pred_3 ?v3)
   (not (pred_10 ?v3 ?v8)) (not (pred_1 ))))


(:action op_1
:parameters (?v8 ?v12 ?v2)
:precondition (and (pred_2 ?v8) (pred_5 ?v12) (pred_5 ?v2)
                  (pred_6 ?v8) (pred_3 ?v2) (pred_10 ?v12 ?v8))
:effect (and (pred_3 ?v12) (pred_10 ?v2 ?v8)
        (not (pred_3 ?v2)) (not (pred_10 ?v12 ?v8))))

(:action op_5
:parameters (?v8 ?v3)
:precondition (and (pred_2 ?v8) (pred_5 ?v3) 
                  (pred_6 ?v8) (pred_3 ?v3))
:effect (and (pred_1 ) (pred_10 ?v3 ?v8) (not (pred_3 ?v3)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_11 obj_09 obj_10 obj_13 obj_07 obj_03 obj_05 obj_01 obj_06
    obj_12 obj_04
    obj_02 obj_08
    )

    (:init
       (pred_1)

       (pred_2 obj_11)
       (pred_2 obj_09)
       (pred_2 obj_10)
       (pred_2 obj_13)
       (pred_2 obj_07)
       (pred_2 obj_03)
       (pred_2 obj_05)
       (pred_2 obj_01)
       (pred_2 obj_06)
       (pred_8 obj_12)
       (pred_8 obj_04)
       (pred_5 obj_02)
       (pred_5 obj_08)

       (pred_7 obj_11 obj_13)
       (pred_7 obj_11 obj_09)
       (pred_7 obj_09 obj_07)
       (pred_7 obj_09 obj_10)
       (pred_7 obj_09 obj_11)
       (pred_7 obj_10 obj_03)
       (pred_7 obj_10 obj_09)
       (pred_7 obj_13 obj_05)
       (pred_7 obj_13 obj_07)
       (pred_7 obj_13 obj_11)
       (pred_7 obj_07 obj_01)
       (pred_7 obj_07 obj_03)
       (pred_7 obj_07 obj_09)
       (pred_7 obj_07 obj_13)
       (pred_7 obj_03 obj_06)
       (pred_7 obj_03 obj_10)
       (pred_7 obj_03 obj_07)
       (pred_7 obj_05 obj_01)
       (pred_7 obj_05 obj_13)
       (pred_7 obj_01 obj_06)
       (pred_7 obj_01 obj_07)
       (pred_7 obj_01 obj_05)
       (pred_7 obj_06 obj_03)
       (pred_7 obj_06 obj_01)
       (pred_12 obj_11)
       (pred_12 obj_07)
       (pred_4  obj_11 obj_12)
       (pred_4  obj_07 obj_04)
       (pred_11 obj_09)
       (pred_11 obj_10)
       (pred_11 obj_13)
       (pred_11 obj_03)
       (pred_11 obj_05)
       (pred_11 obj_01)
       (pred_11 obj_06)

       (pred_9  obj_02 obj_12)
       (pred_9  obj_08 obj_04)
       (pred_10 obj_02 obj_05)
       (pred_10 obj_08 obj_05)
       (pred_6 obj_01)
    )

    (:goal (and
       (pred_10 obj_02 obj_11)
    ))
(:constraints
  (always (not (pred_6 obj_13)))
)
)

; plan
1. (op_2 obj_01 obj_05)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_05)
   goals met: 0 of 1
2. (op_4 obj_05 obj_02)
   deleted: (pred_10 obj_02 obj_05) (pred_1)
   added: (pred_3 obj_02)
   goals met: 0 of 1
3. (op_2 obj_05 obj_01)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_01)
   goals met: 0 of 1
4. (op_2 obj_01 obj_06)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_06)
   goals met: 0 of 1
5. (op_2 obj_06 obj_03)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_03)
   goals met: 0 of 1
6. (op_2 obj_03 obj_10)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_10)
   goals met: 0 of 1
7. (op_2 obj_10 obj_09)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_09)
   goals met: 0 of 1
8. (op_3 obj_09 obj_11 obj_02 obj_12)
   deleted: (pred_12 obj_11)
   added: (pred_11 obj_11)
   goals met: 0 of 1
9. (op_2 obj_09 obj_11)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_11)
   goals met: 0 of 1
10. (op_5 obj_11 obj_02)
   deleted: (pred_3 obj_02)
   added: (pred_1) (pred_10 obj_02 obj_11)
   goals met: 1 of 1
